RSN/src/Catalogs/ЗаявкиНаПредоставлениеДоступа/ЗаявкиНаПредоставлениеДоступа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЗаявкиНаПредоставлениеДоступа</name>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Срочность</name>
    <type>
      <types>EnumRef.ПриоритетыЗаявок</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздатьПользователя</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаявки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Наблюдатели</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>АдерсЭлПочты</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Роль</name>
      <type>
        <types>EnumRef.РолиРассылки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Доступы</name>
    <attributes>
      <name>ИБ</name>
      <type>
        <types>CatalogRef.ИнформационныеБазы</types>
      </type>
    </attributes>
    <attributes>
      <name>Профиль</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДоступыГруппы</name>
    <attributes>
      <name>ИБ</name>
      <type>
        <types>CatalogRef.ИнформационныеБазы</types>
      </type>
    </attributes>
    <attributes>
      <name>Группа</name>
      <type>
        <types>CatalogRef.ГруппыПрофилей</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

RSN/src/InformationRegisters/УчастникиПочтовойРассылки/УчастникиПочтовойРассылки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчастникиПочтовойРассылки</name>
  <resources>
    <name>Выключен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ВидРассылки</name>
    <type>
      <types>EnumRef.ВидыРассылок</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АдерсЭлПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПоУмолчанию</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Роль</name>
    <type>
      <types>EnumRef.РолиРассылки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RSN/src/InformationRegisters/СтатусыЗаявок/СтатусыЗаявок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыЗаявок</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗаявок</types>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Заявка</name>
    <type>
      <types>CatalogRef.ЗаявкиНаПредоставлениеДоступа</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RSN/src/InformationRegisters/ПрофилиПользователей/ПрофилиПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПрофилиПользователей</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Установлено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ПользовательИБ</name>
    <type>
      <types>CatalogRef.ПользователиИБ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИБ</name>
    <type>
      <types>CatalogRef.ИнформационныеБазы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Профиль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RSN/src/Enums/ПриоритетыЗаявок/ПриоритетыЗаявок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПриоритетыЗаявок</name>
  <enumValues>
    <name>Ожидание</name>
  </enumValues>
  <enumValues>
    <name>Низкий</name>
  </enumValues>
  <enumValues>
    <name>Нормальный</name>
  </enumValues>
  <enumValues>
    <name>Срочный</name>
  </enumValues>
  <enumValues>
    <name>Критический</name>
  </enumValues>
</mdclass:Enum>

RSN/src/Enums/СтатусыЗаявок/СтатусыЗаявок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗаявок</name>
  <enumValues>
    <name>Создано</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>ВТесте</name>
  </enumValues>
  <enumValues>
    <name>НаПроверке</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеОтзыва</name>
  </enumValues>
  <enumValues>
    <name>Завершено</name>
  </enumValues>
  <enumValues>
    <name>НаПаузе</name>
  </enumValues>
  <enumValues>
    <name>Отозвано</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеУточнений</name>
  </enumValues>
  <enumValues>
    <name>НаСогласовании</name>
  </enumValues>
  <enumValues>
    <name>Согласовано</name>
  </enumValues>
  <enumValues>
    <name>ОтказаноВСогласовании</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаВыполнения</name>
  </enumValues>
</mdclass:Enum>

RSN/src/Enums/ВидыРассылок/ВидыРассылок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыРассылок</name>
  <enumValues>
    <name>ЗаявкаНаВыдачуПрав</name>
  </enumValues>
</mdclass:Enum>

RSN/src/Catalogs/ИнформационныеБазы/ИнформационныеБазы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИнформационныеБазы</name>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>СерверПриложений</name>
    <type>
      <types>CatalogRef.СерверПриложений</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьНаВебСервере</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Конфигурация</name>
    <type>
      <types>EnumRef.КонфигурацииИнформационныхБаз</types>
    </type>
  </attributes>
  <attributes>
    <name>Тестовая</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Среда</name>
    <type>
      <types>EnumRef.Среда</types>
    </type>
  </attributes>
  <attributes>
    <name>Контур</name>
    <type>
      <types>CatalogRef.Контур</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>БазаДанных</name>
    <type>
      <types>CatalogRef.БазыДанных</types>
    </type>
  </attributes>
</mdclass:Catalog>

RSN/src/Catalogs/ЗаявкиНаПредоставлениеДоступа/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//НастройкиАвторизации = ИнтеграцияКлиент.ПолучитьНастройкиАвторизации(); 
КонецПроцедуры   

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзменениеНастроекАвторизации" Тогда		
		НастройкиАвторизации = ИнтеграцияКлиент.ПолучитьНастройкиАвторизации();	
	ИначеЕсли ИмяСобытия = "Запись_ЗаявкиНаПредоставлениеДоступа" Тогда
		Если Источник = Объект.Ссылка Тогда
			ОбновитьСтатус();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("Ключ") и Не ЗначениеЗаполнено(Параметры.Ключ) Тогда
		Объект.ДатаЗаявки 	= НачалоДня(ОбщегоНазначения.ТекущаяДатаПользователя());
		Объект.Автор 		= Пользователи.АвторизованныйПользователь();
		Объект.Срочность 	= ПредопределенноеЗначение("Перечисление.ПриоритетыЗаявок.Нормальный");
		ЭтоНовый 			= Истина;	
		Статус 				= ПредопределенноеЗначение("Перечисление.СтатусыЗаявок.Создано");
		ЗаполнитьНаблюдателейПоУмолчанию(Объект.Наблюдатели);
	Иначе
		ВывестиДоступыВТаблицу();
		ОбновитьСтатус();
	КонецЕсли  
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаблюдателейПоУмолчанию(ТЗ)  
	ТЗ.Очистить();
	ТзПоУмолчанию =  РегистрыСведений.УчастникиПочтовойРассылки.ПолучитьЗначенияПоУмолчанию(ПредопределенноеЗначение("Перечисление.ВидыРассылок.ЗаявкаНаВыдачуПрав"));
	Если ЗначениеЗаполнено(ТзПоУмолчанию) = Ложь Тогда 
		Возврат;
	КонецЕсли;
	Для Каждого Эл Из ТзПоУмолчанию Цикл 
		ЗаполнитьЗначенияСвойств(ТЗ.Добавить(), Эл);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ЭтоНовый Тогда
		Если РегистрыСведений.СтатусыЗаявок.УстановитьСтатус(ТекущийОбъект.Ссылка, ПредопределенноеЗначение("Перечисление.СтатусыЗаявок.Создано")).Результат = Ложь Тогда
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Объект.Наименование = "" Тогда
		Объект.Наименование = (Объект.ИмяПользователя);
	КонецЕсли;
	
	Если ДоступыИзменены Тогда
		ЗаполнитьТЧДоступы();
		ДоступыИзменены = Ложь;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПолучатели
&НаКлиенте
Процедура ПолучателиПрофилиНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)    
	
	СтандартнаяОбработка = Ложь;   
	
	ТекущиеДанные = Элементы.Получатели.ТекущиеДанные;
		
	ИнформационныеБазы = Новый Массив;
	ИнформационныеБазы.Добавить(ТекущиеДанные.ИБ); 
		
	ОткрытьФормуЗаполненияПрофилейГруппДоступа(ИнформационныеБазы, ТекущиеДанные.Профили.ВыгрузитьЗначения(), Новый Структура("ИБ", ТекущиеДанные.ИБ)); 
		
КонецПроцедуры


&НаКлиенте
Процедура ПолучателиПриИзменении(Элемент)
	ДоступыИзменены = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПолучателиГруппыНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;   
	
	ТекущиеДанные = Элементы.Получатели.ТекущиеДанные;
		
	ИнформационныеБазы = Новый Массив;
	ИнформационныеБазы.Добавить(ТекущиеДанные.ИБ); 
		
	ОткрытьФормуЗаполненияГруппДоступа(ИнформационныеБазы, ТекущиеДанные.Группы.ВыгрузитьЗначения(), Новый Структура("ИБ", ТекущиеДанные.ИБ)); 
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ПодобратьИБ(Команда)   
	
	ОбработкаОповещения = Новый ОписаниеОповещения("ПриЗакрытииФормыПодбораИБ", ЭтотОбъект);
				
	ОткрытьФорму("Справочник.ИнформационныеБазы.Форма.ФормаПодбораИБ",,ЭтотОбъект,УникальныйИдентификатор,,,
													ОбработкаОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);  
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПрофили(Команда) 
	
	ОткрытьФормуЗаполненияПрофилейГруппДоступа();
													
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьГруппы(Команда) 
	
	ОткрытьФормуЗаполненияГруппДоступа();
													
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПрофильПоПользователю(Команда)
	
	ПользовательШаблон = "";
	ОчиститьСообщения();
	ЗаполнитьПрофильИзРСПоПользователю(); 
	ДоступыИзменены = Истина;        
	//ЗаполнитьПрофильПоПользователюЗавершение(Объект.ИмяПользователя, Неопределено);	
	//Оповещение = Новый ОписаниеОповещения("ЗаполнитьПрофильПоПользователюЗавершение", ЭтотОбъект);  
	//Подсказка = НСтр("ru = 'Укажите имя пользователя'");
	//ПоказатьВводСтроки(Оповещение,ПользовательШаблон,Подсказка); 
	
КонецПроцедуры


&НаКлиенте
Процедура ПодобратьИБПоКонфигурации(Команда)  
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("БезТестовых", 	Истина);    
	
	ОбработкаОповещения = Новый ОписаниеОповещения("ПриЗакрытииФормыПодбораИБ", ЭтотОбъект);
				
	ОткрытьФорму("Справочник.ИнформационныеБазы.Форма.ФормаПодбораИБКонфигурация",ДопПараметры,ЭтотОбъект,УникальныйИдентификатор,,,
													ОбработкаОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры
#Конецобласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьПрофильИзРСПоПользователю() 
	
	ТЗПолучатели 	= РеквизитФормыВЗначение("Получатели"); 
	МассивИБ		= ТЗПолучатели.ВыгрузитьКолонку("ИБ");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПрофилиПользователейСрезПоследних.ИБ КАК ИБ,
	               |	ПрофилиПользователейСрезПоследних.Профиль КАК Профиль
	               |ИЗ
	               |	РегистрСведений.ПрофилиПользователей.СрезПоследних КАК ПрофилиПользователейСрезПоследних
	               |ГДЕ
	               |	ПрофилиПользователейСрезПоследних.Установлено
	               |	И ПрофилиПользователейСрезПоследних.ПользовательИБ.Наименование = &ПользовательИБ
	               |	И ПрофилиПользователейСрезПоследних.ИБ В(&ИБ)";
	Запрос.УстановитьПараметр("ПользовательИБ", Объект.ИмяПользователя);
	Запрос.УстановитьПараметр("ИБ", МассивИБ);
	
	УстановитьПривилегированныйРежим(Истина);
	ТЗПрофили = Запрос.Выполнить().Выгрузить(); 
	УстановитьПривилегированныйРежим(Ложь);
	ТЗПрофили.Индексы.Добавить("ИБ"); 
	Отбор = Новый Структура("ИБ");
	
	Для Каждого Стр Из Получатели Цикл
		
		Отбор.ИБ 	= Стр.ИБ;
		Найдено 	= ТЗПрофили.Скопировать(Отбор, "Профиль");
		
		МассивПрофили = Найдено.ВыгрузитьКолонку("Профиль");
		
		Если ЗначениеЗаполнено(МассивПрофили) Тогда 
			Стр.Профили.ЗагрузитьЗначения(МассивПрофили); 
			Стр.Профили.ЗаполнитьПометки(Истина);
			
			СоответствиеГруп 	= Справочники.ГруппыПрофилей.ПолучитьГруппыПрофилейПоПрофилям(СТр.Иб, МассивПрофили); 
			МассивГрупп 		= СоответствиеГруп.Получить(СТр.Иб);
			Если МассивГрупп = Неопределено = Ложь Тогда 
				Стр.Группы.ЗагрузитьЗначения(МассивГрупп);
				Стр.Группы.ЗаполнитьПометки(Истина);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры


&НаСервере
Процедура ВывестиДоступыВТаблицу()
	СпрРеквизит 	= РеквизитФормыВЗначение("Объект");
	ТЗПолучатели 	= РеквизитФормыВЗначение("Получатели");
	ТЗПрофили 		= СпрРеквизит.Доступы.Выгрузить();
	ТЗГруппы 		= СпрРеквизит.ДоступыГруппы.Выгрузить();
	МассивИБ 		= ТЗПрофили.ВыгрузитьКолонку("ИБ");
	МассивИБ 		= ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивИБ);
	Отбор			= Новый Структура("ИБ");
	Для Каждого База Из МассивИБ Цикл
		Отбор.ИБ 		= База;
		НайденныеСтроки = ТЗПрофили.НайтиСтроки(Отбор);
		НоваяСтрока 	= ТЗПолучатели.Добавить();
		НоваяСтрока.ИБ 	= База;
		Для Каждого Строка Из НайденныеСтроки Цикл
			НоваяСтрока.Профили.Добавить(Строка.Профиль);
		КонецЦикла;
		НайденыеГруппы = ТЗГруппы.НайтиСтроки(Отбор);
		Для Каждого Строка Из НайденыеГруппы Цикл
			НоваяСтрока.Группы.Добавить(Строка.Группа);
		КонецЦикла;		
	КонецЦикла;
	ЗначениеВРеквизитФормы(ТЗПолучатели,"Получатели");
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытииФормыПодбораИБ(Результат, ДополнительныеПараметры) Экспорт 
	
	Если Результат = Неопределено Тогда
		Возврат;	
	КонецЕсли; 	
	
	Для Каждого База Из Результат Цикл  
		НайденнаяСтрока = Получатели.НайтиСтроки(Новый Структура("ИБ", База));
		Если НайденнаяСтрока.Количество() = 0 Тогда
			ЗаполнитьЗначенияСвойств(Получатели.Добавить(), Новый Структура("ИБ", База));			
		КонецЕсли;
	КонецЦикла;
	ДоступыИзменены = Истина;	
КонецПроцедуры 

&НаКлиенте
Процедура ЗаполнитьПрофильПоПользователюЗавершение(Строка, ДополнительныеПараметры) Экспорт
	
	Если НЕ Строка = Неопределено И Не ПустаяСтрока(Строка) Тогда
		//ПользовательШаблон = Строка; 
		ЗаполнитьПрофильПоПользователюНаСервере(Строка)	;
		ДоступыИзменены = Истина;        
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуЗаполненияПрофилейГруппДоступа(ИнформационныеБазы = Неопределено, ТекущиеПрофили = Неопределено, ДополнительныеПараметры = Неопределено)
	
	
	Если ИнформационныеБазы = Неопределено Тогда
		
		ИнформационныеБазы = Новый Массив;  	
		Для Каждого Стр Из Получатели Цикл  	
			
			
			ИнформационныеБазы.Добавить(Стр.ИБ);
			
		КонецЦикла; 
		
	КонецЕсли;
	
	Если ИнформационныеБазы.Количество() = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не выбраны информационные базы для заполнения.'"));
		Возврат;
	КонецЕсли;

	ОбработкаОповещения = Новый ОписаниеОповещения("ПриЗакрытииФормыЗаполненияПрофилейГруппДоступа", ЭтотОбъект, ДополнительныеПараметры);
	
	ОткрытьФорму("Справочник.ПрофилиГруппДоступаИнформационныхБаз.Форма.ФормаПодбораПрофилейГруппДоступа", 
					Новый Структура("ИнформационныеБазы, ТекущиеПрофили", ИнформационныеБазы, ТекущиеПрофили),
						ЭтотОбъект,УникальныйИдентификатор,,,ОбработкаОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
						
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуЗаполненияГруппДоступа(ИнформационныеБазы = Неопределено, ТекущиеГруппы = Неопределено, ДополнительныеПараметры = Неопределено)
	
	
	Если ИнформационныеБазы = Неопределено Тогда
		
		ИнформационныеБазы = Новый Массив;  	
		Для Каждого Стр Из Получатели Цикл  	
			
			ИнформационныеБазы.Добавить(Стр.ИБ);
			
		КонецЦикла; 
		
	КонецЕсли;
	
	Если ИнформационныеБазы.Количество() = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не выбраны информационные базы для заполнения.'"));
		Возврат;
	КонецЕсли;  
	Если ДополнительныеПараметры = Неопределено Тогда 
		ДополнительныеПараметры  = Новый Структура;
	КонецЕсли;
	ДополнительныеПараметры.Вставить("Режим", "Группы");
	ОбработкаОповещения = Новый ОписаниеОповещения("ПриЗакрытииФормыЗаполненияПрофилейГруппДоступа", ЭтотОбъект, ДополнительныеПараметры);
	
	ОткрытьФорму("Справочник.ГруппыПрофилей.Форма.ФормаПодбораГруппДоступа", 
					Новый Структура("ИнформационныеБазы, ТекущиеГруппы", ИнформационныеБазы, ТекущиеГруппы),
						ЭтотОбъект,УникальныйИдентификатор,,,ОбработкаОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
						
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытииФормыЗаполненияПрофилейГруппДоступа(Результат, ДополнительныеПараметры) Экспорт 
	
	Если Результат = Неопределено Тогда
		Возврат;	
	КонецЕсли;  
	ДоступыИзменены = Истина;
	ПриЗакрытииФормыЗаполненияПрофилейГруппДоступаНаСервере(Результат, ДополнительныеПараметры);
			
КонецПроцедуры  

&НаСервереБезКонтекста
Функция ПолучитьРежим(ДополнительныеПараметры) 
	Режим = "Профили"; 
	Если ЗначениеЗаполнено(ДополнительныеПараметры) Тогда 
		Если ДополнительныеПараметры.Свойство("Режим") и ЗначениеЗаполнено(ДополнительныеПараметры.Режим) Тогда 
			Режим = ДополнительныеПараметры.Режим;
		КонецЕсли;
	КонецЕсли;    
	Возврат Режим;
КонецФункции

&НаСервереБезКонтекста
Процедура ЗаполнитьСтроку(Стр, Режим, ВыбранныеЗначения)  
	Стр[Режим].ЗагрузитьЗначения(ВыбранныеЗначения);
	Стр[Режим].ЗаполнитьПометки(Истина); 
	
	МассивПрофилейГрупп  	= ПолучитьМассивПрофилейГрупп(Стр.ИБ, Стр.Группы.ВыгрузитьЗначения());
	МассивПрофилей 			= Стр.Профили.ВыгрузитьЗначения();
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивПрофилейГрупп, МассивПрофилей, Истина); 
	
	Стр.Профили.ЗагрузитьЗначения(МассивПрофилейГрупп);
КонецПроцедуры


&НаСервере
Процедура ПриЗакрытииФормыЗаполненияПрофилейГруппДоступаНаСервере(Результат, ДополнительныеПараметры)
	
	Если Не Результат.Получить(Перечисления.КонфигурацииИнформационныхБаз.ПустаяСсылка()) = Неопределено Тогда
		//заполняем по всем    
		Режим = ПолучитьРежим(ДополнительныеПараметры);
		
		ВыбранныеЗначения = Результат.Получить(Перечисления.КонфигурацииИнформационныхБаз.ПустаяСсылка());
		Для Каждого Стр Из Получатели Цикл
			ЗаполнитьСтроку(Стр, Режим, ВыбранныеЗначения);
			//Стр[Режим].Очистить();
			//Для каждого Значение Из ВыбранныеЗначения Цикл
			//	Стр[Режим].Добавить(Значение,,Истина);	
			//КонецЦикла;	
			//Стр[Режим].ЗагрузитьЗначения(ВыбранныеЗначения);
			//Стр[Режим].ЗаполнитьПометки(Истина); 
			//
			//МассивПрофилейГрупп  	= ПолучитьМассивПрофилейГрупп(Стр.ИБ, Стр.Группы.ВыгрузитьЗначения());
			//МассивПрофилей 			= Стр.Профили.ВыгрузитьЗначения();
			//ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивПрофилейГрупп, МассивПрофилей, Истина); 
			//
			//Стр.Профили.ЗагрузитьЗначения(МассивПрофилейГрупп);
		КонецЦикла;
		
	ИначеЕсли ЗначениеЗаполнено(ДополнительныеПараметры) И ДополнительныеПараметры.Свойство("ИБ") Тогда    	
		
		НайденнаяСтрока = Получатели.НайтиСтроки(Новый Структура("ИБ", ДополнительныеПараметры.ИБ));
		ЗаполнитьСтрокуВходящимиДанными(НайденнаяСтрока[0], Результат,ДополнительныеПараметры);
		
	Иначе
		
		Для Каждого Стр Из Получатели Цикл
			
			ЗаполнитьСтрокуВходящимиДанными(Стр, Результат,ДополнительныеПараметры);	
			
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтрокуВходящимиДанными(Стр, ВходящиеДанные, ДополнительныеПараметры = Неопределено)
	ВыбранныеЗначения = ВходящиеДанные.Получить(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.ИБ, "Конфигурация"));
	Если ВыбранныеЗначения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Режим = ПолучитьРежим(ДополнительныеПараметры);
	ЗаполнитьСтроку(Стр, Режим, ВыбранныеЗначения) 
	//Если ПервыйТипГруппа Тогда   
	//	Стр.Группы.ЗагрузитьЗначения(ВыбранныеЗначения);
	//	Стр.Группы.ЗаполнитьПометки(Истина);
	//	//Стр.Группы.Очистить();
	//	//Для Каждого Значение Из ВыбранныеЗначения Цикл
	//	//	Стр.Группы.Добавить(Значение, , Истина);
	//	//КонецЦикла;
	//КонецЕсли;
	//МассивПрофилейГрупп  = ПолучитьМассивПрофилейГрупп(Стр.ИБ, Стр.Группы.ВыгрузитьЗначения());

	//Если ПервыйТипГруппа = Ложь Тогда
	//	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивПрофилейГрупп, ВыбранныеЗначения, Истина);
	//КонецЕсли;

	//Стр.Профили.Очистить();
	//Для Каждого Значение Из МассивПрофилейГрупп Цикл
	//	Стр.Профили.Добавить(Значение, , Истина);
	//КонецЦикла;				
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьМассивПрофилейГрупп(ИБ, МассивГрупп)
	Возврат Справочники.ГруппыПрофилей.ПолучитьМассивПрофилей(ИБ, МассивГрупп);
КонецФункции

&НаСервере
Процедура ЗаполнитьПрофильПоПользователюНаСервере(ПрофильДляЗаполнения)
	
	Если НастройкиАвторизации.ИспользуетсяАутентификацияОС Тогда 
		Аутентификация = Новый Структура("Аутентификация", КоннекторHTTP.НоваяАутентификацияОС());		
	Иначе                                                    
		Аутентификация = Новый Структура("Аутентификация", Новый Структура("Пользователь, Пароль", НастройкиАвторизации.ИмяПользователя, НастройкиАвторизации.Пароль));	
	КонецЕсли;
	
	Для Каждого Стр Из Получатели Цикл
		
		
		ПутьНаВебСервере = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.ИБ, "ПутьНаВебСервере");	
		
		Попытка 
			Ответ = Интеграция.ОбратитьсяКВебСервису(ПутьНаВебСервере, "GET", "DataProcessings/UserAccessGroups", Аутентификация, Новый Структура("ИмяПользователя", ПрофильДляЗаполнения));
		Исключение
			ОбщегоНазначения.СообщитьПользователю("Ошибка при получении сведений о пользователе " + ПутьНаВебСервере + Символы.ПС + ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())); 
		КонецПопытки;  
		
		Если Ответ = Неопределено Тогда 
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(Ответ) = Тип("Структура") Тогда
			Если Ответ.Свойство("error") И Ответ.error Тогда    
				ТекстОшибки = "Ошибка при получении сведений о пользователе " + ПутьНаВебСервере + Символы.ПС + Ответ.message;
				ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);				
			КонецЕсли;				
		КонецЕсли; 
		
		Если Не Ответ.Количество() Тогда 
			Продолжить;
		КонецЕсли;
		
		Стр.Профили.Очистить();
		Для каждого Профиль Из Ответ Цикл
			Стр.Профили.Добавить(Профиль,,Истина);	
		КонецЦикла;		

	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТЧДоступы()
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	ТекущийОбъект.Доступы.Очистить();
	ТекущийОбъект.ДоступыГруппы.Очистить();
	НовоеОписание = "Базы: ";
	Шаблон = "%1 (%2)";
	МассивОписаний = Новый Массив; 
	Для Каждого СтрокаДоступа Из Получатели Цикл
		КоличествоРолей = 0;
		Для Каждого Эл Из СтрокаДоступа.Профили Цикл
			НоваяСтрока = ТекущийОбъект.Доступы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДоступа);
			НоваяСтрока.Профиль = Эл.Значение;
			КоличествоРолей = КоличествоРолей + 1;
		КонецЦикла;
		МассивОписаний.Добавить(СтрШаблон(Шаблон, СтрокаДоступа.ИБ, КоличествоРолей));
		Если СтрокаДоступа.Группы.Количество() = 0 = Ложь Тогда
			Для Каждого Эл Из СтрокаДоступа.Группы Цикл
				НоваяСтрока = ТекущийОбъект.ДоступыГруппы.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДоступа);
				НоваяСтрока.Группа = Эл.Значение;
			КонецЦикла;			
		КонецЕсли;
	КонецЦикла;
	НовоеОписание = НовоеОписание + СтрСоединить(МассивОписаний, ", ");
	ТекущийОбъект.Описание = НовоеОписание;
	ЗначениеВРеквизитФормы(ТекущийОбъект, "Объект");
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтатус()
	СтруктураСтатуса = РегистрыСведений.СтатусыЗаявок.ПолучитьСтатус(Объект.Ссылка);
	Статус = СтруктураСтатуса.Статус;

	Если Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаявок.Создано") = Ложь Тогда
		ТолькоПросмотр = Истина;
	Иначе
		ТолькоПросмотр = Ложь;
	КонецЕсли;       
	Для Каждого Эл из Элементы.Получатели.КоманднаяПанель.ПодчиненныеЭлементы Цикл 
		Эл.Доступность = Не ТолькоПросмотр;
	КонецЦикла;
	
	//ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, 
КонецПроцедуры


&НаКлиенте
Процедура ОчиститьНаблюдателей(Команда)
	Объект.Наблюдатели.Очистить();
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьПоУмолчаниюНаСервере()
	ТЗ = ДанныеФормыВЗначение(Объект.Наблюдатели, Тип("ТаблицаЗначений")); 
	ТЗ.Очистить();
	ЗаполнитьНаблюдателейПоУмолчанию(ТЗ);
	ЗначениеВДанныеФормы(ТЗ,Объект.Наблюдатели);
	
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьПоУмолчанию(Команда)
	ЗаполнитьПоУмолчаниюНаСервере();
КонецПроцедуры
#КонецОбласти
